    IDENTIFICATION DIVISION.
       PROGRAM-ID. COCKROACH-SPEED.
       DATA DIVISION.
       LINKAGE SECTION.
       01 SPEED       PIC 9V9(2).
       01 RESULT      PIC 9(2).
       PROCEDURE DIVISION USING SPEED RESULT.

      * 1 km/h == 27.778 cm/s
          MULTIPLY SPEED BY 27.778 GIVING RESULT
          
          GOBACK.

       END PROGRAM COCKROACH-SPEED.